const test1 = document.getElementById('test1')

//buttontest---------------------------------------------------------------------------------------------------------------------------
const buttontest2 = document.getElementById('buttontest2')

buttontest2.onclick = Button2Click;

function Button2Click(){
  booln = false;
  tables();
}

//buttonlimit---------------------------------------------------------------------------------------------------------------------------
const buttonn = document.getElementById('n1500')

let booln = false;

buttonn.onclick = buttonnClick;

function buttonnClick(){
  booln = true;
  tables();
}

let MinBpm = 0
let MaxBpm = 1000000

function bpmChecker(){
  let tempminbpm = document.getElementById('minbpm').value
  let tempmaxbpm = document.getElementById('maxbpm').value
  
  if(tempminbpm == null || tempminbpm == ''){
    MinBpm = 0
  }else{
    MinBpm = tempminbpm
  }
  
  if(tempmaxbpm == null || tempmaxbpm == ''){
    MaxBpm = 1000000
  }else{
    MaxBpm = tempmaxbpm
  }
}

//tables---------------------------------------------------------------------------------------------------------------------------
const table = document.getElementById('table1')
let aftertable = ''

function tables(){
  const startTime = performance.now()
  
  //>checker boot---------------------------------------------------------------------------------------------------------------------
  bpmChecker()
  
  aftertable = '<tr><th>' + 'NAME' + '</th><th>' + 'ID' + '</th><th>' + 'Ver' + '</th><th>' + 'Diff' + '</th><th>' + 'LV' + '</th><th>' + 'Notes' + '</th><th>' + 'inCHIP' + '</th><th>' + 'inLONG' + '</th><th>' + 'inVOL' + '</th><th>' + 'MAXEX' + '</th><th>' + 'LV_V' + '</th><th>' + 'Notes_V' + '</th><th>' + 'Notes差' + '</th><th>' + 'BPM' + '</th><th>' + 'Artist' + '</th><th>' + 'Effector' + '</th><th>' + 'Vertical_L' + '</th><th>' + 'Vertical_R' + '</th><th>' + 'Vertical' + '</th><th>' + 'Time' + '</th><th>' + 'LV_IV' + '</th><th>' + 'Notes_IV' + '</th><th>' + 'Notes差_IV→V' + '</th><th>' + 'LV_III' + '</th></tr>'
  data.forEach(function (element){
    
    if(element[1] < MinBpm || MaxBpm < element[1]) return true;
    
    if(booln){
      if(element[2] < 1500) return true;
    }
    aftertable += '<tr><td>' + element[0] + '</td><td>' + element[1] + '</td><td>' + element[2] + '</td><td>' + element[3] + '</td><td>' + element[4] + '</td><td>' + element[5] + '</td><td>' + element[6] + '</td><td>' + element[7] + '</td><td>' + element[8] + '</td><td>' + element[9] + '</td><td>' + element[10] + '</td><td>' + element[11] + '</td><td>' + element[12] + '</td><td>' + element[13] + '</td><td>' + element[14] + '</td><td>' + element[15] + '</td><td>' + element[16] + '</td><td>' + element[17] + '</td><td>' + element[18] + '</td><td>' + element[19] + '</td><td>' + element[20] + '</td><td>' + element[21] + '</td><td>' + element[22] + '</td><td>' + element[23] + '</td></tr>'
  });
  
  table.innerHTML = aftertable
  const endTime = performance.now()
  console.log(endTime - startTime)
}

//data---------------------------------------------------------------------------------------------------------------------------
const data = [
  ["Ganymede kamome mix",17001,"Ⅰ","EXH",17,1581,775,302,504,5487,"EXH17",1557,24,200,"kamome sano","PHQUASE",16,16,32,"01:58",EXH17,1557,0,EXH15]
  ["Max Burning!!",17002,"Ⅰ","EXH",17,2054,625,300,1129,5983,"EXH17",1947,107,190,"BlackY","PHQUASE",74,64,138,"02:00",EXH17,1944,3,EXH15]
  ["The world of sound",17003,"Ⅰ","EXH",17,1624,904,377,343,5960,"EXH17",1547,77,210,"Music by Ryuwitty,Vocal by Kuroa*","TEK-A-RHYTHM",11,14,25,"02:00",EXH17,1537,10,EXH15]
  ["V.I.P.",17004,"Ⅰ","EXH",17,1591,860,241,490,5762,"EXH17",1489,102,169,"ismK","TEK-A-RHYTHM",22,22,44,"01:57",EXH17,1486,3,EXH15]
  ["金縛りの逢を",17005,"Ⅰ","EXH",17,1839,898,382,559,6372,"EXH17",1749,90,200,"はるなば","TEK-A-RHYTHM",48,34,82,"02:00",EXH17,1749,0,EXH15]
  ["大宇宙ステージ",17006,"Ⅰ","EXH",17,1368,729,401,238,4923,"EXH17",1279,89,202,"黒魔","TEK-A-RHYTHM",29,33,62,"02:00",EXH17,1296,-17,EXH15]
  ["AA BlackY mix",17007,"Ⅱ","INF",17,1813,636,270,907,5534,"INF17",1668,145,160,"BlackY","MAD CHILD",34,35,69,"01:58",INF17,1668,0,INF15]
  ["ALBIDA Powerless Mix",17008,"Ⅱ","INF",17,1536,570,387,579,4782,"INF17",1444,92,156,"無力P","MAD CHILD",39,33,72,"01:46",INF17,1444,0,INF15]
  ["Distorted Floor",17009,"Ⅱ","INF",17,2083,565,547,971,5861,"INF17",1948,135,95-180,"RoughSketch","MAD CHILD Nightmare",62,53,115,"01:57",INF17,1948,0,INF15]
  ["Dynasty",17010,"Ⅱ","INF",17,1953,833,368,752,6405,"INF17",1865,88,189,"Yooh","Ether99",54,52,106,"01:56",INF17,1865,0,INF15]
  ["good high school",17011,"Ⅱ","INF",17,1700,322,292,1086,4366,"INF17",1664,36,150,"baker","MAD CHILD vs. Hirayasu Matsudo",16,14,30,"01:45",INF17,1664,0,INF15]
  ["Gott",17012,"Ⅱ","INF",17,2104,808,607,689,6632,"INF17",1961,143,195,"Hommarju","THE THIRD MAN",63,62,125,"01:58",INF17,1963,-2,INF15]
  ["TYCOON",17013,"Ⅱ","INF",17,1997,504,493,1000,5506,"INF17",1865,132,170,"SOUND HOLIC feat. Nana Takahashi","PHQUASE",77,70,147,"01:47",INF17,1866,-1,INF15]
  ["ナイト・オブ・ナイツ",17014,"Ⅱ","INF",17,1673,705,283,685,5461,"INF17",1627,46,180,"ビートまりお(COOL&CREATE)","ki4ki4",55,73,128,"01:53",INF17,1627,0,INF15]
  ["天ノ弱",17015,"Ⅱ","INF",17,1872,575,639,658,5469,"INF17",1681,191,200-205,"165 feat. GUMI","THE THIRD MAN",42,46,88,"01:50",INF17,1681,0,INF15]
  ["過食性:アイドル症候群",17016,"Ⅱ","INF",17,2209,812,495,902,6854,"INF17",2130,79,200,"スズム feat.GUMI & MAYU","絶食性:ユカしお症候群",56,49,105,"02:02",INF17,2130,0,INF15]
  ["éclair au chocolat",17017,"Ⅲ","GRV",17,1869,602,286,981,5544,"GRV17",1745,124,182,"kamome sano","しばまる子",52,55,107,"01:52",GRV17,1745,0,GRV15]
  ["EGG",17018,"Ⅲ","GRV",17,1909,687,500,722,5879,"GRV17",1755,154,196,"ginkiha","Ether99",44,47,91,"01:45",GRV17,1755,0,GRV15]
  ["freaky freak",17019,"Ⅲ","GRV",17,1538,1097,441,0,6367,"GRV17",1432,106,145,"kamome sano","TEK-A-RHYTHM",0,0,0,"01:55",GRV17,1432,0,GRV15]
  ["カミサマネジマキ",17020,"Ⅲ","GRV",17,1506,660,255,591,4992,"GRV17",1381,125,284,"kemu feat. GUMI","ki4ki4",44,52,96,"01:46",GRV17,1381,0,GRV15]
  ["香港功夫大旋風",17021,"Ⅲ","GRV",17,2211,623,337,1251,6291,"GRV17",2057,154,178,"Daisuke Ohnuma","SCライオット",128,101,229,"01:55",GRV17,2057,0,GRV15]
  [".59 -BOOTH BOOST REMIX-",17022,"Ⅳ","HVN",17,1329,634,249,446,4560,"HVN17",1259,70,145,"IDEA+RHYTHM","七色Method",47,44,91,"01:42",HVN17,1259,0,-]
  ["cloud",17023,"Ⅳ","HVN",17,1302,452,338,512,3960,"HVN17",1236,66,143,"EZFG","Bob Shimantogawa",35,33,68,"01:43",HVN17,1236,0,-]
  ["Fire Strike",17024,"Ⅳ","HVN",17,1766,725,443,598,5707,"HVN17",1566,200,158,"Junk","ビーフジョッキー",19,26,45,"02:00",HVN17,1566,0,-]
  ["Space Diver Tama",17025,"Ⅳ","HVN",17,1785,667,439,679,5571,"HVN17",1618,167,170,"黒魔","PHQUASE",17,11,28,"02:00",HVN17,1619,-1,-]
  ["Wheel",17026,"Ⅳ","HVN",17,1888,535,535,818,5381,"HVN17",1723,165,136,"Syrufit feat.綾倉盟 / 市松椿","七色Method",40,38,78,"02:07",HVN17,1723,0,-]
  ["イカサマライフゲイム",17027,"Ⅳ","HVN",17,1890,848,363,679,6324,"HVN17",1755,135,200,"kemu feat.GUMI","レッドホットスクリューズ",39,29,68,"02:01",HVN17,1755,0,-]
  ["ケロ⑨destiny",17028,"Ⅳ","HVN",17,2039,662,537,840,6064,"HVN17",1835,204,172,"Silver Forest feat.めらみぽっぷ","レッドホットスクリューズ",47,50,97,"02:05",HVN17,1835,0,-]
  ["サヨナラ・ヘヴン （かめりあ's NEKOMATAelectroRMX）",17029,"Ⅳ","HVN",17,2042,630,500,912,5974,"HVN17",1988,54,150,"かめりあ","浮世マシーン",74,67,141,"01:58",HVN17,1988,0,-]
  ["セツナトリップ",17030,"Ⅳ","HVN",17,1598,658,520,420,5170,"HVN17",1381,217,145,"Last Note. feat. GUMI","PHQUASE",57,44,101,"01:59",HVN17,1381,0,-]
  ["十面相",17031,"V","VVD",17,1536,488,527,521,4536,"VVD17",1285,251,173,"YM feat.GUMI","コーヒーブレイカー",51,52,103,"01:42",-,-,,-]
  ["人生リセットボタン",17032,"V","VVD",17,1908,706,650,552,5934,"VVD17",1708,200,200,"kemu feat. GUMI","ビーフジョッキー",33,39,72,"01:56",-,-,,-]
  ["BabeL ～Next Story～",17033,"Ⅱ","EXH",17,2016,814,572,630,6474,"EXH17",1837,179,100-173,"Power Of Nature","TEK-A-リ☆chan",48,53,101,"02:08",EXH17,1814,23,EXH15]
  ["Booths of Fighters",17034,"Ⅱ","EXH",17,2140,652,641,847,6236,"EXH17",2021,119,155-225,"RoughSketch +DD"ナカタ"Metal","MAD CHILD",32,30,62,"01:56",EXH17,2019,2,EXH15]
  ["CODE -CRiMSON-",17035,"Ⅱ","EXH",17,2204,851,344,1009,6961,"EXH17",2081,123,167,"Shiron","TEK-A-RHYTHM × 逆球レジェンド",57,49,106,"02:01",EXH17,2081,0,EXH15]
  ["DEADLOCK XXX",17036,"Ⅱ","EXH",17,2082,667,361,1054,6165,"EXH17",1934,148,222,"BlackY","月刊ミズタニ",31,30,61,"01:34",EXH17,1944,-10,EXH15]
  ["Decretum",17037,"Ⅱ","EXH",17,1978,866,496,616,6554,"EXH17",1806,172,98-197,"Project Mayhem","レッドホットスクリューズ",52,35,87,"02:00",EXH17,1793,13,EXH15]
  ["#FairyJoke #SDVX_Edit",17038,"Ⅱ","EXH",17,2260,76,124,2060,4748,"EXH17",1988,272,160,"uno(IOSYS)","Hirayasu Matsudo",104,94,198,"01:59",EXH17,1988,0,EXH15]
  ["Fiat Lux",17039,"Ⅱ","EXH",17,2364,768,940,656,7032,"EXH17",2266,98,200,"xi","Ether99",53,56,109,"01:59",EXH17,2266,0,EXH15]
  ["FIRE FIRE -DARK BLAZE REMIX-",17040,"Ⅱ","EXH",17,1927,799,488,640,6251,"EXH17",1733,194,177,"Yooh","月刊ミズタニ",67,66,133,"01:57",EXH17,1733,0,EXH15]
  ["FLYING OUT TO THE SKY",17041,"Ⅱ","EXH",17,2031,814,482,735,6504,"EXH17",1885,146,244,"かめりあ","PHQUASE",47,43,90,"01:59",EXH17,1885,0,EXH15]
  ["gigadelic -stance xxxx-",17042,"Ⅱ","EXH",17,1604,869,276,459,5815,"EXH17",1513,91,199,"Hate","TEK-A-RHYTHM",11,22,33,"01:51",EXH17,1513,0,EXH15]
  ["HAELEQUIN",17043,"Ⅱ","EXH",17,1815,684,541,590,5682,"EXH17",1737,78,172,"orangentle / Yu_Asahina","レッドホットスクリューズ",46,47,93,"01:56",EXH17,1721,16,EXH15]
  ["Harpuia",17044,"Ⅱ","EXH",17,1807,693,413,701,5693,"EXH17",1707,100,93-186,"BlackY","レッドホットスクリューズ×PHQUASE",55,32,87,"01:54",EXH17,1707,0,EXH15]
  ["Hellfire",17045,"Ⅱ","EXH",17,2064,715,225,1124,6273,"EXH17",2015,49,176,"Hommarju","月刊ミズタニ",86,92,178,"01:59",EXH17,2005,10,EXH15]
  ["HYENA",17046,"Ⅱ","EXH",17,2094,510,609,975,5718,"EXH17",1955,139,178,"Hommarju","ねちっこく堂",139,154,293,"02:00",EXH17,1944,11,EXH15]
  ["Idola",17047,"Ⅱ","EXH",17,2676,760,765,1151,7632,"EXH17",2505,171,201,"iconoclasm feat.GUMI","PHQUASE vs. FUKASE",24,30,54,"02:10",EXH17,2505,0,EXH15]
  ["Innocent Tempest",17048,"Ⅱ","EXH",17,2344,701,551,1092,6791,"EXH17",2266,78,180,"Diceros Bicornis","PHQUASE",80,80,160,"01:59",EXH17,2266,0,EXH15]
  ["IX",17049,"Ⅱ","EXH",17,2401,791,768,842,7175,"EXH17",2248,153,198,"dj TAKA VS DJ TOTTO feat.藍","月刊ミズタッチ",51,55,106,"02:00",EXH17,2249,-1,EXH15]
  ["Joyeuse",17050,"Ⅱ","EXH",17,1317,711,204,402,4767,"EXH17",1249,68,260-274,"ke-ji","Ether99",21,24,45,"01:40",EXH17,1240,9,EXH15]
  ["KiLLeR MeRMaiD",17051,"Ⅱ","EXH",17,1921,758,440,723,6116,"EXH17",1768,153,440,"QURELESS","Ether99",60,46,106,"01:56",EXH17,1768,0,EXH15]
  ["Last Concerto",17052,"Ⅱ","EXH",17,1586,628,290,668,5056,"EXH17",1467,119,220,"ke-ji","Ether99",38,37,75,"01:42",EXH17,1461,6,EXH15]
  ["Little princess has no identity.",17053,"Ⅱ","EXH",17,1992,707,499,786,6105,"EXH17",1854,138,185,"0kash","Megacycle",37,34,71,"01:59",EXH17,1854,0,EXH15]
  ["Mist In Hell",17054,"Ⅱ","EXH",17,1943,546,442,955,5524,"EXH17",1833,110,225,"LUNA","レッドホットスクリューズ",61,56,117,"01:50",EXH17,1833,0,EXH15]
  ["Our Faith (Faithful MTL Remix)",17055,"Ⅱ","EXH",17,2301,729,1000,572,6789,"EXH17",2154,147,185,"DOUBLE HELIX","しばまる子 vs. TEK-A-RHYTHM",21,18,39,"01:59",EXH17,2154,0,EXH15]
  ["Pure Evil",17056,"Ⅱ","EXH",17,1759,651,468,640,5471,"EXH17",1603,156,190,"kors k","PHQUASE",46,37,83,"01:54",EXH17,1604,-1,EXH15]
  ["Pure Evil-Aya2g Drm'n Tech Rmx-",17057,"Ⅱ","EXH",17,1734,832,334,568,5964,"EXH17",1697,37,190,"Ayatsugu_Otowa","TAKUYA",91,77,168,"01:56",EXH17,1698,-1,EXH15]
  ["Quietus Ray",17058,"Ⅱ","EXH",17,2311,692,603,1016,6698,"EXH17",2229,82,200,"xi","Ether99",69,52,121,"02:00",EXH17,2228,1,EXH15]
  ["Sakura Mirage",17059,"Ⅱ","EXH",17,1663,814,334,515,5768,"EXH17",1580,83,187,"Ryu☆","Sammy/A rejected by 赤バステルくん",60,30,90,"01:45",EXH17,1580,0,EXH15]
  ["snow storm -euphoria-",17060,"Ⅱ","EXH",17,2184,890,348,946,7038,"EXH17",2122,62,89-180,"Yooh","TEK-A-RHYTHM",41,24,65,"02:01",EXH17,2122,0,EXH15]
  ["True Blue",17061,"Ⅱ","EXH",17,1890,752,583,555,6036,"EXH17",1810,80,164,"dj TAKA feat.AiMEE","PHQUASE",30,25,55,"02:03",EXH17,1768,42,EXH15]
  ["U.N.オーエンは彼女なのか？ haru_naba Remix",17062,"Ⅱ","EXH",17,1842,782,415,645,6030,"EXH17",1755,87,140-200,"はるなば","PHQUASE",74,60,134,"02:01",EXH17,1755,0,EXH15]
  ["Verse IV",17063,"Ⅱ","EXH",17,1999,956,499,544,6866,"EXH17",1868,131,212,"ZOGRAPHOS (Yu_Asahina+Yamajet)","レッドホットスクリューズ",15,12,27,"02:02",EXH17,1869,-1,EXH15]
  ["Wish upon Twin Stars",17064,"Ⅱ","EXH",17,2112,689,487,936,6291,"EXH17",2011,101,200,"xi","浮世マシーン",56,56,112,"01:59",EXH17,2011,0,EXH15]
  ["XROSS INFECTION",17065,"Ⅱ","EXH",17,2101,636,416,1049,6110,"EXH17",1976,125,194,"BlackY vs. Yooh","PHQUASE vs. FUKASE",67,58,125,"01:58",EXH17,1955,21,EXH15]
  ["イゴモヨス＝オムルのテーマによるブヨブヨ・スケッチの試み",17066,"Ⅱ","EXH",17,1865,855,495,515,6295,"EXH17",1780,85,200,"日本楽音ノイズ協会","レッドホットスクリューズ",32,33,65,"01:58",EXH17,1780,0,EXH15]
  ["バンブーソード・ガール",17067,"Ⅱ","EXH",17,2133,726,429,978,6444,"EXH17",2010,123,208,"cosMo@暴走P","PHQUASE ver.1.5",87,81,168,"01:53",EXH17,2011,-1,EXH15]
  ["ボルテ体操第一",17068,"Ⅱ","EXH",17,1561,716,321,524,5270,"EXH17",1452,109,175-200,"Kaoru feat.FG75","Megacycle",49,42,91,"01:58",EXH16,1452,0,EXH15]
  ["ムーニャポヨポヨスッポコニャーゴ",17069,"Ⅱ","EXH",17,1594,926,145,523,5966,"EXH17",1539,55,180,"全日本スッポコニャーゴ親衛隊","博多の男",25,25,50,"01:56",EXH17,1539,0,EXH15]
  ["朱と碧のランページ",17070,"Ⅱ","EXH",17,1988,557,623,808,5647,"EXH17",1819,169,178,"NU-KO","Antonio Guccini",55,71,126,"02:06",EXH17,1819,0,EXH15]
  ["悪性ロリィタマキャヴェリズム",17071,"Ⅱ","EXH",17,1616,752,315,549,5488,"EXH17",1530,86,280,"かいりきベア","Megacycle",60,66,126,"02:04",EXH17,1532,-2,EXH15]
  ["音楽 -resolve-",17072,"Ⅱ","EXH",17,1737,661,416,660,5457,"EXH17",1632,105,114-220,"Yu_Asahina","PHQUASE",49,48,97,"02:06",EXH17,1635,-3,EXH15]
  ["音楽 -壊音楽 mix-",17073,"Ⅱ","EXH",17,1507,422,334,751,4280,"EXH17",1379,128,270-420,"LeaF","Megacycle & MAD CHILD",63,70,133,"01:54",EXH17,1368,11,EXH15]
  ["少女暴動",17074,"Ⅱ","EXH",17,1810,759,445,606,5897,"EXH17",1761,49,300,"Last Note.","azuma",50,46,96,"02:00",EXH17,1761,0,EXH15]
  ["信仰は儚き人間の為に ～ Arr.Demetori",17075,"Ⅱ","EXH",17,2195,730,519,946,6580,"EXH17",2019,176,220,"Demetori","逆球レジェンド",34,37,71,"01:49",EXH17,2019,0,EXH15]
  ["超越してしまった彼女と其を生み落した理由",17076,"Ⅱ","EXH",17,1967,755,512,700,6199,"EXH17",1842,125,178,"Ayatsugu_Otowa","TEK-A-RHYTHM",66,52,118,"01:56",EXH17,1838,4,EXH15]
  ["轟け！恋のビーンボール！！",17077,"Ⅱ","EXH",17,1795,600,471,724,5390,"EXH17",1594,201,180,"ダイナミック野球兄弟 v.s. クロスファイヤーPrim","がんばれ!!ミズしおくん",80,90,170,"01:51",EXH17,1594,0,EXH15]
  ["柳の下のデュラハン hard chaos mix",17078,"Ⅱ","EXH",17,2146,618,344,1184,6146,"EXH17",2031,115,220,"albel.","Megacycle",98,86,184,"01:52",EXH17,2031,0,EXH15]
  ["御千手メディテーション",17079,"Ⅱ","INF",17,1810,724,565,521,5792,"INF17",1596,214,150-190,"昇天家族","MAD CHILD",41,41,82,"02:00",INF17,1596,0,INF15]
  ["患部で止まってすぐ溶ける  ～ 狂気の優曇華院",17080,"Ⅱ","INF",17,2182,713,557,912,6503,"INF17",1951,231,200,"ARM(IOSYS)","狂気のふかせ",53,30,83,"02:12",INF16,1951,0,INF15]
  ["打打打打打打打打打打",17081,"Ⅱ","INF",17,1850,763,102,985,5989,"INF17",1759,91,156,"ヒゲドライバー join. SELEN","SHOUTICE",45,43,88,"01:44",INF17,1759,0,INF15]
  ["Appliqué",17082,"Ⅲ","GRV",17,2724,588,787,1349,7212,"GRV17",2481,243,224,"モリモリあつし","Megacycle",60,58,118,"02:00",GRV17,2481,0,GRV15]
  ["choux à la crème",17083,"Ⅲ","GRV",17,2114,653,654,807,6187,"GRV17",1894,220,192,"kamome sano","ビーフジョッキー",76,78,154,"02:01",GRV17,1894,0,GRV15]
  ["Double Universe",17084,"Ⅲ","GRV",17,2016,758,529,729,6306,"GRV17",1915,101,180,"Hommarju vs P*Light","ビーフジョッキー",86,67,153,"01:58",GRV17,1915,0,GRV15]
  ["Erlung",17085,"Ⅲ","GRV",17,1827,550,651,626,5304,"GRV17",1621,206,140,"削除","Ether99",19,23,42,"02:02",GRV17,1621,0,GRV15]
  ["INFINITY OVERDRIVE",17086,"Ⅲ","GRV",17,1709,676,440,593,5446,"GRV17",1554,155,185,"DecisionS(kanone + nora2r)","MADしばまるCHILD",37,35,72,"01:58",GRV17,1554,0,GRV15]
  ["Last Battalion",17087,"Ⅲ","GRV",17,2209,612,610,987,6254,"GRV17",2016,193,185,"ETIA.","レッドホットスクリューズ",35,32,67,"01:56",GRV17,2016,0,GRV15]
  ["LittleGameStar",17088,"Ⅲ","GRV",17,2397,725,419,1253,6969,"GRV17",2204,193,215,"An","風瑠人",30,32,62,"01:59",GRV17,2204,0,GRV15]
  ["odds and ends",17089,"Ⅲ","GRV",17,1767,541,535,691,5157,"GRV17",1620,147,264,"MarcheИ","Megacycle",50,78,128,"01:59",GRV17,1620,0,GRV15]
  ["ウバワレ",17090,"Ⅲ","GRV",17,1891,613,668,610,5621,"GRV17",1725,166,190,"TAKU1175","レッドホットスクリューズ",48,39,87,"01:48",GRV17,1724,1,GRV15]
  ["少年は空を辿る Prog Piano Remix",17091,"Ⅲ","GRV",17,1712,1003,184,525,6433,"GRV17",1644,68,140,"とろまる","Megaまる子",26,25,51,"01:58",GRV17,1647,-3,GRV15]
  ["雪女",17092,"Ⅲ","GRV",17,2295,683,591,1021,6639,"GRV17",2111,184,200,"かねこちはる","Megacyclone",32,39,71,"01:58",GRV17,2111,0,GRV15]
  ["Hoshizora Illumination",17093,"Ⅳ","HVN",17,2416,683,828,905,6881,"HVN17",2240,176,210,"you","ビーフジョッキー",57,55,112,"02:00",HVN17,2240,0,-]
  ["take a step forward",17094,"Ⅳ","HVN",17,2106,782,605,719,6558,"HVN17",1889,217,190,"uma","ダークダークダーク",23,11,34,"01:59",HVN17,1892,-3,-]
  ["幻想系世界修復少女",17095,"Ⅳ","HVN",17,1875,508,425,942,5274,"HVN17",1731,144,193,"Last Note.","浮世マシーン",66,64,130,"01:40",HVN17,1731,0,-]
  ["竹取飛翔",17096,"Ⅳ","HVN",17,1945,712,597,636,6026,"HVN17",1774,171,156,"岸田教団＆THE明星ロケッツ","THE THIRD MAN",35,33,68,"02:04",HVN17,1774,0,-]
  ["放課後ストライド",17097,"Ⅳ","HVN",17,2892,543,698,1651,7413,"HVN17",2698,194,225,"Last Notes.","NOX",94,98,192,"02:01",HVN17,2698,0,-]
  ["０=Xerostrumental=",17098,"Ⅲ","EXH",17,1742,779,270,693,5821,"EXH17",1650,92,168,"cosMo@暴走P","cosMo@暴走P",38,37,75,"01:58",EXH17,1649,1,EXH15]
  ["2 MINUTES FIGHTERS",17099,"Ⅲ","EXH",17,2061,821,440,800,6585,"EXH17",1933,128,203,"P*Light","月刊♦マシーン",94,99,193,"02:02",EXH17,1933,0,EXH15]
]
