const test1 = document.getElementById('test1')

//buttontest---------------------------------------------------------------------------------------------------------------------------
const buttontest2 = document.getElementById('buttontest2')

buttontest2.onclick = Button2Click;

function Button2Click(){
  booln = false;
  tables();
}

//buttonlimit---------------------------------------------------------------------------------------------------------------------------
const buttonn = document.getElementById('n1500')

let booln = false;

buttonn.onclick = buttonnClick;

function buttonnClick(){
  booln = true;
  tables();
}

let MinBpm = 0
let MaxBpm = 1000000

function bpmChecker(){
  let tempminbpm = document.getElementById('minbpm').value
  let tempmaxbpm = document.getElementById('maxbpm').value
  
  if(tempminbpm == null || tempminbpm == ''){
    MinBpm = 0
  }else{
    MinBpm = tempminbpm
  }
  
  if(tempmaxbpm == null || tempmaxbpm == ''){
    MaxBpm = 1000000
  }else{
    MaxBpm = tempmaxbpm
  }
}

//tables---------------------------------------------------------------------------------------------------------------------------
const table = document.getElementById('table1')
let aftertable = ''

function tables(){
  const startTime = performance.now()
  
  //>checker boot---------------------------------------------------------------------------------------------------------------------
  bpmChecker()
  
  aftertable = '<tr><th>' + 'NAME' + '</th><th>' + 'ID' + '</th><th>' + 'Ver' + '</th><th>' + 'Diff' + '</th><th>' + 'LV' + '</th><th>' + 'Notes' + '</th><th>' + 'inCHIP' + '</th><th>' + 'inLONG' + '</th><th>' + 'inVOL' + '</th><th>' + 'MAXEX' + '</th><th>' + 'LV_V' + '</th><th>' + 'Notes_V' + '</th><th>' + 'Notes差' + '</th><th>' + 'BPM' + '</th><th>' + 'Artist' + '</th><th>' + 'Effector' + '</th><th>' + 'Vertical_L' + '</th><th>' + 'Vertical_R' + '</th><th>' + 'Vertical' + '</th><th>' + 'Time' + '</th><th>' + 'LV_IV' + '</th><th>' + 'Notes_IV' + '</th><th>' + 'Notes差_IV→V' + '</th><th>' + 'LV_III' + '</th></tr>'
  data.forEach(function (element){
    
    if(element[1] < MinBpm || MaxBpm < element[1]) return true;
    
    if(booln){
      if(element[2] < 1500) return true;
    }
    aftertable += '<tr><td>' + element[0] + '</td><td>' + element[1] + '</td><td>' + element[2] + '</td><td>' + element[3] + '</td><td>' + element[4] + '</td><td>' + element[5] + '</td><td>' + element[6] + '</td><td>' + element[7] + '</td><td>' + element[8] + '</td><td>' + element[9] + '</td><td>' + element[10] + '</td><td>' + element[11] + '</td><td>' + element[12] + '</td><td>' + element[13] + '</td><td>' + element[14] + '</td><td>' + element[15] + '</td><td>' + element[16] + '</td><td>' + element[17] + '</td><td>' + element[18] + '</td><td>' + element[19] + '</td><td>' + element[20] + '</td><td>' + element[21] + '</td><td>' + element[22] + '</td><td>' + element[23] + '</td></tr>'
  });
  
  table.innerHTML = aftertable
  const endTime = performance.now()
  console.log(endTime - startTime)
}

//data---------------------------------------------------------------------------------------------------------------------------
const data = [
  ["akasha-assembly",17100,"Ⅲ","EXH",17,1699,599,307,793,5195,"EXH17",1603,96,153,"溝口ゆうま from セブンスヘブンAmmy's","Megacycle",63,67,130,"02:05","EXH17",1603,0,"EXH15"],
  ["{albus}",17101,"Ⅲ","EXH",17,2208,662,393,1153,6402,"EXH17",2010,198,198,"かめりあ","風瑠人",76,64,140,"01:59","EXH17",2010,0,"EXH15"],
  ["Aliquam",17102,"Ⅲ","EXH",17,1721,562,529,630,5128,"EXH17",1555,166,"70-158","たちのん","凹ーダー凸ード",47,41,88,"01:58","EXH17",1555,0,"EXH15"],
  ["ANTI THE∞HOLiC",17103,"Ⅲ","EXH",17,1947,652,453,842,5850,"EXH17",1815,132,170,"GAiA×cosMo@暴走P","cosMo@暴走P",47,50,97,"01:59","EXH17",1814,1,"EXH15"],
  ["Apex of the World",17104,"Ⅲ","EXH",17,1605,672,416,517,5226,"EXH17",1497,108,169,"uma&hurirai feat.ましろ","レッドホットスクリューズ",46,53,99,"01:59","EXH17",1497,0,"EXH15"],
  ["AYAKASHI",17105,"Ⅲ","EXH",17,2497,417,199,1881,6245,"EXH17",2427,70,140,"Hommarju","ねちっこく堂",133,139,272,"02:01","EXH17",2427,0,"EXH15"],
  ["B.B.K.K.B.K.K.",17106,"Ⅲ","EXH",17,2024,363,400,1261,5137,"EXH17",1804,220,170,"nora2r","M.M.M.M.M.M.M.",79,81,160,"02:06","EXH17",1804,0,"EXH15"],
  ["Backflow",17107,"Ⅲ","EXH",17,1627,534,523,570,4856,"EXH17",1390,237,145,"lapix","MAD CHILD",63,61,124,"02:01","EXH17",1390,0,"EXH15"],
  ["BEAT-NEW-WORLD",17108,"Ⅲ","EXH",17,2186,700,488,998,6472,"EXH17",2066,120,190,"ビートまりお（COOL&CREATE)","SCバイオメトリクス",64,74,138,"01:58","EXH17",2066,0,"EXH15"],
  ["Borealis",17109,"Ⅲ","EXH",17,1999,819,230,950,6455,"EXH17",1941,58,196,"ginkiha","SCバイオメトリクス",21,22,43,"01:54","EXH17",1941,0,"EXH15"],
  ["Candy Colored Hearts",17110,"Ⅲ","EXH",17,1976,825,420,731,6427,"EXH17",1828,148,193,"はるなば","風瑠人",71,70,141,"02:01","EXH17",1828,0,"EXH15"],
  ["CENSORED!!",17111,"Ⅲ","EXH",17,2020,600,508,912,5840,"EXH17",1828,192,195,"t+pazolite","PHQUASE",86,87,173,"01:53","EXH17",1826,2,"EXH15"],
  ["Chant du Cygne",17112,"Ⅲ","EXH",17,2250,631,1039,580,6393,"EXH17",2151,99,140-190,"ke-ji","Ether99",13,13,26,"02:01","EXH17",2151,0,"EXH15"],
  ["Clash of swords",17113,"Ⅲ","EXH",17,2094,784,449,861,6540,"EXH17",1913,181,229,"Noah","TEK-A-RHYTHM",55,56,111,"01:57","EXH17",1913,0,"EXH15"],
  ["conflict",17114,"Ⅲ","EXH",17,2243,684,586,973,6538,"EXH17",1979,264,160,"siromaru + cranky","MAD CHILD + Megacycle",55,54,109,"02:07","EXH17",1979,0,"EXH15"],
  ["continew",17115,"Ⅲ","EXH",17,1925,407,873,645,5071,"EXH17",1771,154,64-256,"Verdammt","Ether99",46,48,94,"02:00","EXH17",1771,0,"EXH15"],
  ["CRITICAL LINE",17116,"Ⅲ","EXH",17,1732,597,112,1023,5255,"EXH17",1648,84,128,"Ryu☆ feat. kradness","Hermit♣club",65,67,132,"01:57","EXH17",1648,0,"EXH15"],
  ["cross the future",17117,"Ⅲ","EXH",17,1955,542,290,1123,5536,"EXH17",1777,178,179,"uma","東京ブルトゥーム",61,58,119,"01:59","EXH17",1777,0,"EXH15"],
  ["CUTIE☆EX-DREAM",17118,"Ⅲ","EXH",17,1929,786,453,690,6216,"EXH17",1785,144,188,"BlackY","ビーフジョッキー",40,36,76,"02:00","EXH17",1785,0,"EXH15"],
  ["Deadly Dolly Dance",17119,"Ⅲ","EXH",17,1485,715,287,483,5115,"EXH17",1368,117,160,"Shiron","Megacycle",78,80,158,"02:01","EXH17",1368,0,"EXH15"],
  ["DIABLOSIS::Nāga",17120,"Ⅲ","EXH",17,2297,420,290,1587,5854,"EXH17",2052,245,200,"sky_delta","月刊風瑠タニ",81,82,163,"01:55","EXH17",2052,0,"EXH15"],
  ["Discloze",17121,"Ⅲ","EXH",17,2121,645,241,1235,6177,"EXH17",1971,150,128-145,"lapix","月刊ミズタニ",61,71,132,"02:01","EXH17",1971,0,"EXH15"],
  ["Dualive",17122,"Ⅲ","EXH",17,2212,723,476,1013,6593,"EXH17",2052,160,190,"Quarks(kradness×Camellia)","POT-E-RHYTHM",83,82,165,"02:07","EXH17",2053,-1,"EXH15"],
  ["EBONY & IVORY",17123,"Ⅲ","EXH",17,1438,657,335,446,4847,"EXH17",1363,75,113-170,"OSTER project","SCバイオメトリクスR",36,31,67,"01:42","EXH17",1363,0,"EXH15"],
  ["ΕΛΠΙΣ",17124,"Ⅲ","EXH",17,1976,810,382,784,6382,"EXH17",1849,127,175,"dj TAKA","Yu-tomo",47,44,91,"02:04","EXH17",1849,0,"EXH15"],
  ["Emperor's Divide",17125,"Ⅲ","EXH",17,2238,767,770,701,6777,"EXH17",1999,239,220,"にゃそ","凹ーダー凸ード",35,33,68,"01:55","EXH17",1999,0,"EXH15"],
  ["Enigma",17126,"Ⅲ","EXH",17,1909,881,409,619,6461,"EXH17",1739,170,198,"とろまる","Megacycle",72,71,143,"02:00","EXH17",1739,0,"EXH15"],
  ["Everlasting Message",17127,"Ⅲ","EXH",17,2249,719,564,966,6655,"EXH17",2102,147,230,"ぺのれり","PHQUASE forever",75,59,134,"01:57","EXH17",2102,0,"EXH15"],
  ["F.K.S.",17128,"Ⅲ","EXH",17,1664,681,423,560,5371,"EXH17",1519,145,185,"Nizikawa","PHQUASE",48,42,90,"01:48","EXH17",1519,0,"EXH15"],
  ["False Cross",17129,"Ⅲ","EXH",17,1922,829,351,742,6331,"EXH17",1779,143,162,"BlackY","月刊ミズタニ × Hermit♣club",49,46,95,"02:00","EXH17",1683,96,"EXH15"],
  ["FIRE FIRE(Kazmasa Remix)",17130,"Ⅲ","EXH",17,2208,673,363,1172,6435,"EXH17",2065,143,190,"Kazmasa","ねちマシーン",80,86,166,"02:01","EXH17",2068,-3,"EXH15"],
  ["Follow Up",17131,"Ⅲ","EXH",17,1868,670,319,879,5746,"EXH17",1608,260,175,"あるふぁ","月刊ミズタニ",38,35,73,"02:00","EXH17",1611,-3,"EXH15"],
  ["Garakuta Doll Play",17132,"Ⅲ","EXH",17,1866,696,379,791,5820,"EXH17",1594,272,256,"t+pazolite 「maimai」より","浮世マイーン",76,77,153,"02:05","EXH17",1594,0,"EXH15"],
  ["gigadelic(m3rkAb4# R3m!x)",17133,"Ⅲ","EXH",17,2029,780,377,872,6398,"EXH17",1936,93,180-916,"ikaruga_nex","月刊ミズタニ",34,28,62,"02:00","EXH17",1416,520,"EXH15"],
  ["Got more raves？",17134,"Ⅲ","EXH",17,1621,782,409,430,5588,"EXH17",1516,105,266,"E.G.G.「グルーヴコースター」より","七色Method",46,44,90,"02:03","EXH17",1516,0,"EXH15"],
  ["Halcyon",17135,"Ⅲ","EXH",17,2174,676,899,599,6376,"EXH17",2014,160,40-191,"xi","Ether99",29,27,56,"02:04","EXH17",2014,0,"EXH15"],
  ["Happy Sensation",17136,"Ⅲ","EXH",17,2193,566,557,1070,6084,"EXH17",2078,115,180,"IckPo","東京ブルトゥーム",39,34,73,"01:58","EXH17",2078,0,"EXH15"],
  ["Help me, ERINNNNNN!! -Cranky remix-",17137,"Ⅲ","EXH",17,1976,676,643,657,5980,"EXH17",1807,169,180,"ビートまりお × Cranky","七色Method",72,60,132,"02:03","EXH17",1807,0,"EXH15"],
  ["Innocent Floor",17138,"Ⅲ","EXH",17,2083,703,350,1030,6275,"EXH17",1981,102,199,"P*Light","SCバイオメトリクス",90,94,184,"01:55","EXH17",1981,0,"EXH15"],
  ["JOMANDA",17139,"Ⅲ","EXH",17,2180,672,601,907,6376,"EXH17",1988,192,90-300,"DJ YOSHITAKA","†PHQUASE†",51,35,86,"02:10","EXH17",1987,1,"EXH15"],
  ["KAC 2012 ULTIMATE MEDLEY -HISTORIA SOUND VOLTEX- ",17140,"Ⅲ","EXH",17,2372,895,360,1117,7429,"EXH17",2340,32,200,"FLOOR LEGENDS -KAC 2012-","SOUND VOLTEX Effectors",62,57,119,"02:29","EXH17",2340,0,"EXH15"],
  ["Lord=Crossight",17141,"Ⅲ","EXH",17,1826,705,621,500,5767,"EXH17",1707,119,154,"ぺのれり","PHQUASE the Exceed",45,52,97,"02:03","EXH17",1707,0,"EXH15"],
  ["Lucky*Clover",17142,"Ⅲ","EXH",17,1986,696,543,747,6060,"EXH17",1860,126,200,"Shiron＋こふ×モリモリあつしと提供でお送りします。","ユカリ♣ポテト",62,60,122,"01:58","EXH17",1860,0,"EXH15"],
  ["Mayohiga Spurt",17143,"Ⅲ","EXH",17,2088,744,519,825,6408,"EXH17",1876,212,192,"さわわ","Ether99",52,40,92,"02:01","EXH17",1876,0,"EXH15"],
  ["Metamorphobia",17144,"Ⅲ","EXH",17,1745,795,424,526,5875,"EXH17",1653,92,160,"winddrums","Megacycle",49,50,99,"01:58","EXH17",1653,0,"EXH15"],
  ["NEON WORLD",17145,"Ⅲ","EXH",17,2162,879,544,739,6961,"EXH17",2026,136,154-164,"SOUND HOLIC feat. Nana Takahashi","スカイシュート",75,59,134,"02:15","EXH17",2026,0,"EXH15"],
  ["Never Fails",17146,"Ⅲ","EXH",17,1934,742,400,792,6094,"EXH17",1814,120,151,"lapix","風瑠マシーン",51,57,108,"02:00","EXH17",1814,0,"EXH15"],
  ["Nofram",17147,"Ⅲ","EXH",17,1980,619,478,883,5817,"EXH17",1857,123,132,"unatra","風瑠人",89,92,181,"01:47","EXH17",1857,0,"EXH15"],
  ["Opium and Purple haze",17148,"Ⅲ","EXH",17,1453,734,597,122,5108,"EXH17",1314,139,165,"D.watt(OTAKU-ELITE Recordings)","Hiroyasu Matsuda",11,12,23,"01:49","EXH17",1318,-4,"EXH15"],
  ["Paradission",17149,"Ⅲ","EXH",17,1738,774,400,564,5798,"EXH17",1628,110,154,"BlackY","PHQUASE",45,60,105,"02:00","EXH17",1628,0,"EXH15"],
  ["Parousia",17150,"Ⅲ","EXH",17,2279,683,960,636,6607,"EXH17",2067,212,158,"xi","Ether99",29,33,62,"02:14","EXH17",2067,0,"EXH15"],
  ["Pet Peeve",17151,"Ⅲ","EXH",17,1806,180,94,1532,4152,"EXH17",1673,133,140,"Hirayasu Matsudo","Hirayasu Matsudo",83,79,162,"01:58","EXH17",1674,-1,"EXH15"],
  ["Pieces of a Dream",17152,"Ⅲ","EXH",17,1947,837,519,591,6405,"EXH17",1789,158,202,"uma vs. モリモリあつし","レッドホットスクリューズ",35,31,66,"02:00","EXH17",1789,0,"EXH15"],
  ["Pure Evil (Kobaryo FTN-Remix)",17153,"Ⅲ","EXH",17,1746,994,184,568,6474,"EXH17",1637,109,380,"Kobaryo","月刊ミズタニ",38,39,77,"01:55","EXH17",1636,1,"EXH15"],
  ["REGALIA",17154,"Ⅲ","EXH",17,2801,590,1125,1086,7372,"EXH17",2575,226,222,"Riz","Megacycle",63,61,124,"01:56","EXH17",2575,0,"EXH15"],
  ["Rubeus",17155,"Ⅲ","EXH",17,1835,699,408,728,5767,"EXH17",1681,154,200,"RedMuffleR","月刊ミズタニ × 博多の男",63,65,128,"01:52","EXH17",1681,0,"EXH15"],
  ["S1CK_F41RY",17156,"Ⅲ","EXH",17,1972,493,358,1121,5423,"EXH17",1717,255,177,"HOUJIROU","ブルーコールドハリケーンズ",113,105,218,"02:00","EXH17",1717,0,"EXH15"],
  ["Shanghai Wu Long ～上海舞龍～",17157,"Ⅲ","EXH",17,1841,821,282,738,6145,"EXH17",1636,205,171,"Hommarju","風瑠人",25,31,56,"01:56","EXH17",1636,0,"EXH15"],
  ["Stleq",17158,"Ⅲ","EXH",17,2180,768,752,660,6664,"EXH17",2026,154,200,"ぬゆり","レッドホットスクリューズ♠TEK-A-RHYTHM",40,40,80,"01:58","EXH17",2026,0,"EXH15"],
  ["The End of War",17159,"Ⅲ","EXH",17,1983,821,522,640,6429,"EXH17",1844,139,194,"たちのん as Project Mayhem","ダークダークダーク",58,74,132,"01:55","EXH17",1844,0,"EXH15"],
  ["The Sampling Paradise (P*Light Remix)",17160,"Ⅲ","EXH",17,1674,538,435,701,4962,"EXH17",1569,105,181,"P*Light","IIDXで九段受かれないSCバイオメトリクス",62,64,126,"01:47","EXH17",1569,0,"EXH15"],
  ["The setting sun",17161,"Ⅲ","EXH",17,1852,152,140,1560,4160,"EXH17",1468,384,140,"DJ YASETAKA","Hirayasu Matsudo",46,48,94,"01:56","EXH17",1469,-1,"EXH15"],
  ["The star in eclipse",17162,"Ⅲ","EXH",17,2444,666,871,907,6886,"EXH17",2191,253,220,"しーけー","MAD CHILD MOONLiGHT",26,29,55,"01:53","EXH17",2191,0,"EXH15"],
  ["THUNDERCRACK",17163,"Ⅲ","EXH",17,1898,560,748,590,5476,"EXH17",1705,193,190,"IRON ATTACK!","TEK-A-RHYTHM",39,56,95,"01:56","EXH17",1706,-1,"EXH15"],
  ["TIEFSEE",17164,"Ⅲ","EXH",17,2208,848,555,805,6960,"EXH17",2028,180,165,"SOUND HOLIC Vs. dj TAKA feat. YURiCa","MAK-O-RHYTHM",37,29,66,"02:15","EXH17",2027,1,"EXH15"],
  ["Time to Air -Fly High Remix-",17165,"Ⅲ","EXH",17,2027,884,422,721,6706,"EXH17",1944,83,202,"xi","MAD CHILD",67,65,132,"01:56","EXH17",1944,0,"EXH15"],
  ["TOXIC VIBRATION",17166,"Ⅲ","EXH",17,1948,767,441,740,6197,"EXH17",1873,75,197,"SOUND HOLIC Vs. T.Kakuta feat. YURiCa","SCバイオメトリクス",45,40,85,"02:07","EXH17",1873,0,"EXH15"],
  ["Triple Counter",17167,"Ⅲ","EXH",17,2334,712,672,950,6804,"EXH17",2177,157,216,"DJ YOSHITAKA meets dj TAKA","TEK-A meets RHYTHM",67,58,125,"02:02","EXH17",2175,2,"EXH15"],
  ["Twin Rocket",17168,"Ⅲ","EXH",17,1821,608,345,868,5466,"EXH17",1701,120,185,"uno feat. ちよこ(IOSYS)","月刊ミズタニ",61,61,122,"02:00","EXH17",1596,105,"EXH15"],
  ["UROBØROS",17169,"Ⅲ","EXH",17,1825,593,259,973,5429,"EXH17",1689,136,129,"溝口ゆうま feat. 大瀬良あい","月刊ミズタニ",50,57,107,"01:53","EXH17",1689,0,"EXH15"],
  ["Vampire's Territory",17170,"Ⅲ","EXH",17,1692,737,329,626,5595,"EXH17",1591,101,140-280,"u-z","レッドホットスクリューズ",78,85,163,"02:00","EXH17",1591,0,"EXH15"],
  ["Virtual Bit",17171,"Ⅲ","EXH",17,2100,441,497,1162,5523,"EXH17",1905,195,152,"KAN TAKAHIKO","Padcontrollers",72,85,157,"01:58","EXH17",1905,0,"EXH15"],
  ["Voynich:Manuscript",17172,"Ⅲ","EXH",17,1940,708,367,865,6004,"EXH17",1839,101,164,"かゆき","浮世マシーン",44,43,87,"01:55","EXH17",1839,0,"EXH15"],
  ["Witch in Sweetsland",17173,"Ⅲ","EXH",17,2057,920,388,749,6874,"EXH17",1976,81,185,"COOKIE MONSTERS(winddrums+黒魔)","七色Method",37,33,70,"02:01","EXH17",1975,1,"EXH15"],
  ["Zero-Day Exploit",17174,"Ⅲ","EXH",17,2030,741,647,642,6283,"EXH17",1920,110,194,"Trerey-U","cosMo@暴走P",41,36,77,"01:58","EXH17",1920,0,"EXH15"],
  ["アキネイション",17175,"Ⅲ","EXH",17,1873,585,554,734,5501,"EXH17",1726,147,185,"ビートまりお（COOL&CREATE）","PHQUASE",76,68,144,"01:52","EXH17",1726,0,"EXH15"],
  ["あれこれそれどれ",17176,"Ⅲ","EXH",17,2176,626,357,1193,6230,"EXH17",2015,161,194,"YM feat. 赤飯","浮世マシーン",72,71,143,"01:46","EXH17",2015,0,"EXH15"],
  ["イグジスタンス",17177,"Ⅲ","EXH",17,2007,734,396,877,6216,"EXH17",1877,130,200,"スズム","TEK-A-RHYTHM",50,43,93,"01:58","EXH17",1877,0,"EXH15"],
  ["きらきらタイム☆",17178,"Ⅲ","EXH",17,1992,744,285,963,6216,"EXH17",1910,82,202,"さわわ","Ether99",68,64,132,"02:00","EXH17",1779,131,"EXH15"],
  ["ゲキツイムラサ",17179,"Ⅲ","EXH",17,1930,678,526,726,5894,"EXH17",1768,162,185,"ビートまりお（COOL&CREATE）","風瑠人",44,41,85,"01:48","EXH17",1768,0,"EXH15"],
  ["じゅーじゅー♥焼肉の火からフェニックス！？～再誕の†炭火焼き",17180,"Ⅲ","EXH",17,2126,550,473,1103,5902,"EXH17",1974,152,180,"かめりあ feat. ななひら","でひゃいましゅぅぅぅ～～っっ！！！ふかせ",85,121,206,"01:58","EXH17",1974,0,"EXH15"],
  ["そして紫の幻想曲は全てを受け入れる",17181,"Ⅲ","EXH",17,1814,803,406,605,6037,"EXH17",1673,141,174,"黄泉路テヂーモ×dawn-system","ビーフジョッキー",41,39,80,"01:55","EXH17",1673,0,"EXH15"],
  ["チルノとまりおのパーフェクトさんすう教室",17182,"Ⅲ","EXH",17,2015,550,483,982,5680,"EXH17",1890,125,180,"ビートまりお（COOL&CREATE）","ボブ☆四万十川のパーフェクトダンス教室",66,86,152,"02:04","EXH17",1890,0,"EXH15"],
  ["ネメシス SDVX Edit",17183,"Ⅲ","EXH",17,2008,767,471,770,6317,"EXH17",1880,128,146,"Larca","浮世マシーン",78,83,161,"01:57","EXH17",1880,0,"EXH15"],
  ["パ→ピ→プ→Yeah!",17184,"Ⅲ","EXH",17,1879,566,256,1057,5456,"EXH17",1756,123,160,"ヒゲドライバー join. shully & Nimo","月刊ミズタニS",97,92,189,"01:44","EXH17",1756,0,"EXH15"],
  ["ほおずき程度には赤い頭髪",17185,"Ⅲ","EXH",17,2125,692,625,808,6326,"EXH17",1927,198,174,"Akhuta","ほおずき程度には赤いYUK-A-RHYTHM",75,101,176,"01:58","EXH17",1927,0,"EXH15"],
  ["ホーンテッド★メイドランチ",17186,"Ⅲ","EXH",17,2315,674,590,1051,6652,"EXH17",2185,130,188,"日向美ビタースイーツ♪","Hermit♣club",63,63,126,"01:57","EXH17",2185,0,"EXH15"],
  ["ぼくらしかしらない",17187,"Ⅲ","EXH",17,1782,791,299,692,5937,"EXH17",1749,33,180,"ぬゆり","TEK-A-RHYTHM",41,43,84,"01:55","EXH17",1749,0,"EXH15"],
  ["鬼天",17188,"Ⅲ","EXH",17,1821,668,322,831,5646,"EXH17",1666,155,161,"兎々","浮世マシーン",42,32,74,"01:51","EXH17",1666,0,"EXH15"],
  ["感情の魔天楼 ～ Arr.Demetori",17189,"Ⅲ","EXH",17,2474,704,812,958,7060,"EXH17",2304,170,178,"Demetori","月刊バイオメトリクス",37,24,61,"01:55","EXH17",2304,0,"EXH15"],
  ["雲の彼方",17190,"Ⅲ","EXH",17,1666,707,172,787,5453,"EXH17",1644,22,150,"Cororo","SCバイオメトリクス",52,54,106,"01:55","EXH17",1644,0,"EXH15"],
  ["紅の剣舞",17191,"Ⅲ","EXH",17,2172,715,641,816,6489,"EXH17",2036,136,190,"かねこちはる","Ether99",47,46,93,"02:00","EXH17",2037,-1,"EXH15"],
  ["黒髪乱れし修羅となりて～凛 edition～",17192,"Ⅲ","EXH",17,1928,715,391,822,6001,"EXH17",1878,50,150,"日向美ビタースイーツ♪","SCミズタニ",91,91,182,"02:05","EXH17",1878,0,"EXH15"],
  ["漆黒のスペシャルプリンセスサンデー",17193,"Ⅲ","EXH",17,2398,596,817,985,6584,"EXH17",2236,162,200,"日向美ビタースイーツ♪","ビーフジョッキー",61,57,118,"02:06","EXH17",2236,0,"EXH15"],
  ["雪月花 -さわわ Remix-",17194,"Ⅲ","EXH",17,2029,778,632,619,6392,"EXH17",1897,132,188,"さわわ","Ether99",40,44,84,"01:55","EXH17",1897,0,"EXH15"],
  ["断罪は遍く人間の元に",17195,"Ⅲ","EXH",17,1849,497,735,617,5189,"EXH17",1696,153,170,"Unlucky Morpheus","レッドホットスクリューズ",28,28,56,"01:42","EXH17",1695,1,"EXH15"],
  ["常夏！！クリスタライズ・シャーベット",17196,"Ⅲ","EXH",17,1815,311,338,1166,4563,"EXH17",1703,112,152,"Ayatsugu_Otowa","凹ーダー凸ー堂",156,159,315,"01:58","EXH17",1703,0,"EXH15"],
  ["夏色DIARY -Summer Dazzlin' Vacation miX-",17197,"Ⅲ","EXH",17,1866,632,487,747,5628,"EXH17",1718,148,155,"猫叉王子 feat. PHQUASE vs. MAD CHILD","PHQUASE vs. MAD CHILD",48,50,98,"02:09","EXH16",1718,0,"EXH15"],
  ["人形裁判 -THIRD IMPACT-",17198,"Ⅲ","EXH",17,1792,776,640,376,5912,"EXH17",1618,174,198,"激戦の人","Ether99",23,28,51,"02:00","EXH17",1618,0,"EXH15"],
  ["暴走",17199,"Ⅲ","EXH",17,1393,584,266,543,4538,"EXH17",1331,62,310,"cosMo@暴走P","MAD CHILD",39,33,72,"01:42","EXH17",1331,0,"EXH15"]
]
